/**************************************************************
running-line.ino
BlackBug Engineering
16.12.2017
https://github.com/dbprof/4d-running-line
***************************************************************/

// Подключаем библиотеку работы с 4-значным экраном
#include <TM1637.h>

// Переменная для вывода на экран
int8_t TEXT[] = {0, 0, 0, 0};

// Количество символов в переменной TubeTab библиотеки TM1637.cpp
int imax = 36;

// Переменная текущего номера символа
int icur = 0;

// Пины для подключения
#define CLK 3
#define DIO 2

// Создание объект класса
TM1637 tm1637(CLK, DIO);

void setup()
{
  //Инициализация модуля
  tm1637.init();

  //Установка яркости 0~7
  tm1637.set(7); 
}

void loop() 
{
  // Не выводим двоеточие (для часов)
  tm1637.point(false);

  // Если достигли конца массива символов, то начинаем сначала
  if (icur + 3 > imax) icur = 0;
  TEXT[0] = icur;
  TEXT[1] = icur+1;
  TEXT[2] = icur+2;
  TEXT[3] = icur+3;
  icur++;

  // Выводим на дисплей
  tm1637.display(TEXT);
  delay(200);
}
